/*
 * @Author: cxm
 * @LastEditors: cxm
 * @Date: 2021-12-24 11:42:49
 * @LastEditTime: 2022-11-04 16:19:30
 * @Description:
 */
import ChinaCity from "/public/map/coords/ChinaCity";

const geoCoordMap = {
  北京: [116.525424, 40.277672],
  天津: [117.482083, 39.341208],
  河北: [115.274407, 38.362957],
  山西: [112.257251, 37.128518],
  内蒙古: [110.748672, 41.423192],
  黑龙江: [128.520461, 46.950597],
  吉林: [126.975088, 43.332681],
  辽宁: [123.553191, 41.06214],
  上海: [121.403438, 31.097639],
  山东: [117.997207, 36.067855],
  江苏: [119.800142, 33.240592],
  安徽: [117.445288, 31.112728],
  浙江: [120.094499, 28.96795],
  江西: [115.691077, 27.604804],
  福建: [118.068928, 25.995128],
  河南: [113.82837, 33.792663],
  湖北: [112.26918, 31.212352],
  湖南: [111.754056, 27.539223],
  海南: [109.803942, 19.12266],
  广西: [109.569377, 24.084451],
  广东: [113.653577, 24.016868],
  重庆: [107.633061, 29.810576],
  四川: [102.628997, 30.042951],
  贵州: [107.485883, 27.046109],
  云南: [101.511361, 24.421822],
  西藏: [88.412486, 31.693395],
  陕西: [108.295364, 33.646196],
  甘肃: [104.505521, 34.928903],
  宁夏: [106.124483, 37.316797],
  青海: [96.559326, 35.707387],
  新疆: [85.542507, 39.949912],
  台湾: [120.989499, 23.63605],
  香港: [114.082031, 22.836945],
  澳门: [113.557912, 22.193541],
};

export function convertChinaData(data) {
  return data.map((item) => {
    return {
      ...item,
      value: [...ChinaCity[item.name], item.value, item],
    };
  });
}

export function convertChinaData2(data) {
  return data.map((item) => {
    return [...ChinaCity[item.name], item.value, item];
  });
}

export function convertWorldData(data) {
  return data.map((item) => {
    return {
      coords: [
        [75, 52.25, 1],
        [geoCoordMap[item.name][0], geoCoordMap[item.name][1], item.value],
      ],
    };
  });
}

export function convertWorldData2(data) {
  return data.map((item) => {
    return {
      coords: [
        [75, 52.25, 1],
        [geoCoordMap2[item.name][0], geoCoordMap2[item.name][1], item.value],
      ],
    };
  });
}

const geoCoordMap2 = {
  北京市: [116.525424, 40.277672], //市 省   自治区
  天津市: [117.482083, 39.341208],
  河北省: [115.274407, 38.362957],
  山西省: [112.257251, 37.128518],
  内蒙古自治区: [110.748672, 41.423192],
  黑龙江省: [128.520461, 46.950597],
  吉林省: [126.975088, 43.332681],
  辽宁省: [123.553191, 41.06214],
  上海市: [121.403438, 31.097639],
  山东省: [117.997207, 36.067855],
  江苏省: [119.800142, 33.240592],
  安徽省: [117.445288, 31.112728],
  浙江省: [120.094499, 28.96795],
  江西省: [115.691077, 27.604804],
  福建省: [118.068928, 25.995128],
  河南省: [113.82837, 33.792663],
  湖北省: [112.26918, 31.212352],
  湖南省: [111.754056, 27.539223],
  海南省: [109.803942, 19.12266],
  广西壮族自治区: [109.569377, 24.084451],
  广东省: [113.653577, 24.016868],
  重庆市: [107.633061, 29.810576],
  四川省: [102.628997, 30.042951],
  贵州省: [107.485883, 27.046109],
  云南省: [101.511361, 24.421822],
  西藏自治区: [88.412486, 31.693395],
  陕西省: [108.295364, 33.646196],
  甘肃省: [104.505521, 34.928903],
  宁夏回族自治区: [106.124483, 37.316797],
  青海省: [96.559326, 35.707387],
  新疆维吾尔自治区: [85.542507, 39.949912],
  台湾省: [120.989499, 23.63605],
  香港特别行政区: [114.082031, 22.836945],
  澳门特别行政区: [113.557912, 22.193541],
};

const jsGeoCoordMap = {
  南京市: [118.767413, 32.041544],
  无锡市: [120.301663, 31.574729],
  徐州市: [117.684811, 34.161792],
  常州市: [119.946973, 31.772752],
  苏州市: [120.619585, 31.299379],
  南通市: [120.864608, 32.316212],
  连云港市: [119.178821, 34.400018],
  淮安市: [119.021265, 33.597506],
  盐城市: [120.139998, 33.377631],
  扬州市: [119.421003, 32.593159],
  镇江市: [119.452753, 32.104402],
  泰州市: [120.095176, 32.284882],
  宿迁市: [118.475162, 33.963008],
};

const jsGeoCoordMap2 = {
  南京市: [
    [118.85065, 32.340655],
    [118.625307, 32.05839],
    [118.850621, 31.953418],
    [118.792199, 32.050678],
    [118.87589, 31.327132],
  ],
  无锡市: [
    [120.266053, 31.550228],
    [119.820538, 31.364384],
    [120.352782, 31.550966],
    [120.303543, 31.681019],
    [120.275891, 31.910984],
  ],
  徐州市: [
    [117.963923, 34.314708],
    [117.95066, 33.899222],
    [117.194589, 34.254805],
    [117.450212, 34.441642],
    [116.937182, 34.729044],
  ],
  常州市: [
    [119.487816, 31.427081],
    [119.573395, 31.744399],
    [119.958773, 31.718566],
    [119.948388, 31.78096],
    [119.974654, 31.824664],
  ],
  苏州市: [
    [120.74852, 31.658156],
    [120.958137, 31.381925],
    [120.624621, 31.270839],
    [120.641601, 31.160404],
    [121.112275, 31.452568],
  ],
  南通市: [
    [121.073171, 32.084287],
    [121.186088, 32.311832],
    [120.566324, 32.391591],
    [121.176609, 31.893528],
    [120.465995, 32.540288],
  ],
  连云港市: [
    [119.179793, 34.601584],
    [119.255741, 34.298436],
    [118.766489, 34.522859],
    [119.128774, 34.839154],
    [119.352331, 34.092553],
  ],
  淮安市: [
    [119.019454, 33.603234],
    [119.14634, 33.507499],
    [118.867875, 33.294975],
    [119.266078, 33.771308],
    [119.016936, 33.018162],
  ],
  盐城市: [
    [120.257444, 33.773779],
    [119.828434, 33.989888],
    [120.470324, 33.199531],
    [119.805338, 33.78573],
    [120.314101, 32.853174],
  ],
  扬州市: [
    [119.443842, 32.785164],
    [119.567481, 32.426564],
    [119.397777, 32.377899],
    [119.182443, 32.271965],
    [119.321284, 33.23694],
  ],
  镇江市: [
    [119.433883, 32.128972],
    [119.167135, 31.947355],
    [119.581911, 31.991459],
    [119.454571, 32.206191],
    [119.828054, 32.237266],
  ],
  泰州市: [
    [120.148208, 32.508483],
    [119.920187, 32.488406],
    [119.88166, 32.315701],
    [120.020228, 32.168784],
    [119.840162, 32.938065],
  ],
  宿迁市: [
    [118.330012, 33.941071],
    [118.681284, 33.711433],
    [118.278984, 33.937726],
    [118.211824, 33.456538],
    [118.775889, 34.129097],
  ],
};

export function convertData(data) {
  return data.map((item) => {
    return [
      geoCoordMap[item.name][0],
      geoCoordMap[item.name][1],
      item.value,
      item.name,
    ];
  });
}
export function convertDataOrder(data) {
  return data.map((item) => {
    return [
      geoCoordMap[item.name][0],
      geoCoordMap[item.name][1],
      item.value,
      item.name,
      item.tool,
    ];
  });
}
export function convertDataPlace(data) {
  return data.map((item) => {
    return [
      geoCoordMap[item.name][0],
      geoCoordMap[item.name][1],
      item.value,
      item.name,
    ];
  });
}

export function getProvinceCood(name) {
  console.log("🚀 ~ getProvinceCood ~ name:", name);
  return geoCoordMap2[name] ? geoCoordMap2[name] : [];
}

export function convertData1(data) {
  return data.map((item) => {
    return [
      geoCoordMap2[item.name][0],
      geoCoordMap2[item.name][1],
      item.value,
      item.value1,
      item.name,
      item.max,
      item.min,
    ];
  });
}

export function convertJsData(data) {
  return data.map((item) => {
    return [
      jsGeoCoordMap[item.name][0],
      jsGeoCoordMap[item.name][1],
      item.value,
      item.name,
    ];
  });
}

export function getCoord(name) {
  if (!name) return [];
  return jsGeoCoordMap[name] ? jsGeoCoordMap[name] : [];
}

export function convertCityData2(data) {
  return data.map((item) => {
    return {
      name: item.name,
      value: [geoCoordMap[item.name][0], geoCoordMap[item.name][1], item.value],
    };
  });
}
export function convertCityData(data) {
  return data.map((item) => {
    return {
      ...item,
      value: [geoCoordMap[item.name][0], geoCoordMap[item.name][1], item.value],
    };
  });
}

export function convertCityDatash(data) {
  return data.map((item) => {
    return {
      ...item,
      value: [
        geoCoordMap2[item.name][0],
        geoCoordMap2[item.name][1],
        item.value,
      ],
    };
  });
}

export function convertData2(data) {
  let temp = data.filter((item) => {
    return geoCoordMap2[item.name] && geoCoordMap2[item.name].length > 0;
  });
  return temp.map((item) => {
    return [
      geoCoordMap2[item.name][0],
      geoCoordMap2[item.name][1],
      item.value,
      item,
    ];
  });
}

export function JSConvertListData(list) {
  let arr = [];
  let newList = [];
  list.forEach((item) => {
    let index = arr.findIndex((itm) => itm.name === item.name);
    if (index === -1) {
      let coord = jsGeoCoordMap2[item.name][0];
      arr.push({
        name: item.name,
        list: [{ value: [coord[0], coord[1], item.value], data: item.data }],
      });
    } else {
      let length = arr[index].list.length;
      let coord = jsGeoCoordMap2[item.name][length];
      arr[index].list.push({
        value: [coord[0], coord[1], item.value],
        data: item.data,
      });
    }
  });
  arr.forEach((item) => {
    item.list.forEach((itm) => {
      newList.push({
        name: item.name,
        value: itm.value,
        data: itm.data,
      });
    });
  });
  return newList;
}

export function JSConvertListData2(list) {
  console.log("🚀 ~ JSConvertListData2 ~ list:", list);
  let arr = list.map((item) => {
    return {
      name: item.name,
      value: jsGeoCoordMap[item.name] ? jsGeoCoordMap[item.name] : [],
      data: item.value,
      info: item,
    };
  });
  return arr;
}

export const getProvinceName = (name) => {
  const dict = {
    台湾省: "台湾",
    河北省: "河北",
    山西省: "山西",
    内蒙古自治区: "内蒙古",
    辽宁省: "辽宁",
    吉林省: "吉林",
    黑龙江省: "黑龙江",
    江苏省: "江苏",
    浙江省: "浙江",
    安徽省: "安徽",
    福建省: "福建",
    江西省: "江西",
    山东省: "山东",
    河南省: "河南",
    湖北省: "湖北",
    湖南省: "湖南",
    广东省: "广东",
    广西壮族自治区: "广西",
    海南省: "海南",
    四川省: "四川",
    贵州省: "贵州",
    云南省: "云南",
    西藏自治区: "西藏",
    陕西省: "陕西",
    甘肃省: "甘肃",
    青海省: "青海",
    宁夏回族自治区: "宁夏",
    新疆维吾尔自治区: "新疆",
    北京市: "北京",
    天津市: "天津",
    上海市: "上海",
    重庆市: "重庆",
    香港特别行政区: "香港",
    澳门特别行政区: "澳门",
    钓鱼岛: "钓鱼岛",
    赤尾屿: "赤尾屿",
  };
  return dict[name];
};

export const getProvinceName1 = (name) => {
  const dict = {
    台湾: "台湾省",
    河北: "河北省",
    山西: "山西省",
    内蒙古自治区: "内蒙古自治区",
    辽宁: "辽宁省",
    吉林: "吉林省",
    黑龙江: "黑龙江省",
    江苏: "江苏省",
    浙江: "浙江省",
    安徽: "安徽省",
    福建: "福建省",
    江西: "江西省",
    山东: "山东省",
    河南: "河南省",
    湖北: "湖北省",
    湖南: "湖南省",
    广东: "广东省",
    广西壮族自治区: "广西壮族自治区",
    海南: "海南省",
    四川: "四川省",
    贵州: "贵州省",
    云南: "云南省",
    西藏自治区: "西藏",
    陕西: "陕西省",
    甘肃: "甘肃省",
    青海: "青海省",
    宁夏回族自治区: "宁夏回族自治区",
    新疆维吾尔自治区: "新疆维吾尔自治区",
    北京: "北京市",
    天津: "天津市",
    上海: "上海市",
    重庆: "重庆市",
    香港特别行政区: "香港",
    澳门特别行政区: "澳门",
    钓鱼岛: "钓鱼岛",
    赤尾屿: "赤尾屿",
  };
  return dict[name];
};

export const provinceNameMap = {
  台湾省: "台湾",
  河北省: "河北",
  山西省: "山西",
  内蒙古自治区: "内蒙古",
  辽宁省: "辽宁",
  吉林省: "吉林",
  黑龙江省: "黑龙江",
  江苏省: "江苏",
  浙江省: "浙江",
  安徽省: "安徽",
  福建省: "福建",
  江西省: "江西",
  山东省: "山东",
  河南省: "河南",
  湖北省: "湖北",
  湖南省: "湖南",
  广东省: "广东",
  广西壮族自治区: "广西",
  海南省: "海南",
  四川省: "四川",
  贵州省: "贵州",
  云南省: "云南",
  西藏自治区: "西藏",
  陕西省: "陕西",
  甘肃省: "甘肃",
  青海省: "青海",
  宁夏回族自治区: "宁夏",
  新疆维吾尔自治区: "新疆",
  北京市: "北京",
  天津市: "天津",
  上海市: "上海",
  重庆市: "重庆",
  香港特别行政区: "香港",
  澳门特别行政区: "澳门",
  钓鱼岛: "钓鱼岛",
  赤尾屿: "赤尾屿",
};
export const getProvinceName2 = (name) => {
  const dict = {
    台湾: "台湾",
    河北: "河北",
    山西: "山西",
    内蒙古自治区: "内蒙古",
    辽宁: "辽宁",
    吉林: "吉林",
    黑龙江: "黑龙江",
    江苏: "江苏",
    浙江: "浙江",
    安徽: "安徽",
    福建: "福建",
    江西: "江西",
    山东: "山东",
    河南: "河南",
    湖北: "湖北",
    湖南: "湖南",
    广东: "广东",
    广西壮族自治区: "广西",
    海南: "海南",
    四川省: "四川",
    贵州: "贵州",
    云南省: "云南",
    西藏自治区: "西藏",
    陕西: "陕西",
    甘肃省: "甘肃",
    青海: "青海",
    宁夏回族自治区: "宁夏",
    新疆维吾尔自治区: "新疆",
    北京: "北京",
    天津: "天津",
    上海: "上海",
    重庆: "重庆",
    香港特别行政区: "香港",
    澳门特别行政区: "澳门",
    钓鱼岛: "钓鱼岛",
    赤尾屿: "赤尾屿",
  };
  return dict[name];
};

export const getProvinceName3 = (name) => {
  const dict = {
    台湾: "台湾省",
    河北: "河北省",
    山西: "山西省",
    内蒙古: "内蒙古自治区",
    辽宁: "辽宁省",
    吉林: "吉林省",
    黑龙江: "黑龙江省",
    江苏: "江苏省",
    浙江: "浙江省",
    安徽: "安徽省",
    福建: "福建省",
    江西: "江西省",
    山东: "山东省",
    河南: "河南省",
    湖北: "湖北省",
    湖南: "湖南省",
    广东: "广东省",
    广西: "广西壮族自治区",
    海南: "海南省",
    四川: "四川省",
    贵州: "贵州省",
    云南: "云南省",
    西藏: "西藏自治区",
    陕西: "陕西省",
    甘肃: "甘肃省",
    青海: "青海省",
    宁夏: "宁夏回族自治区",
    新疆: "新疆维吾尔自治区",
    北京: "北京市",
    天津: "天津市",
    上海: "上海市",
    重庆: "重庆市",
    香港特别行政区: "香港",
    澳门特别行政区: "澳门",
    钓鱼岛: "钓鱼岛",
    赤尾屿: "赤尾屿",
  };
  return dict[name] || "";
};
