export const data = [
  {
    en: "Afghanistan",
    cn: "阿富汗",
    cp: [69.11, 34.28],
  },
  {
    en: "Angola",
    cn: "安哥拉",
    cp: [13.15, -8.5],
  },
  {
    en: "Albania",
    cn: "阿尔巴尼亚",
    cp: [19.49, 41.18],
  },
  {
    en: "United Arab Emirates",
    cn: "阿联酋",
    cp: [54.22, 24.28],
  },
  {
    en: "Argentina",
    cn: "阿根廷",
    cp: [-60.0, -36.3],
  },
  {
    en: "Armenia",
    cn: "亚美尼亚",
    cp: [44.31, 40.1],
  },
  {
    en: "French Southern and Antarctic Lands",
    cn: "法属南半球和南极领地",
  },
  {
    en: "Australia",
    cn: "澳大利亚",
    cp: [135.08, -25.15],
  },
  {
    en: "Austria",
    cn: "奥地利",
    cp: [16.22, 48.12],
  },
  {
    en: "Azerbaijan",
    cn: "阿塞拜疆",
    cp: [49.56, 40.29],
  },
  {
    en: "Burundi",
    cn: "布隆迪",
    cp: [29.18, -3.16],
  },
  {
    en: "Belgium",
    cn: "比利时",
    cp: [4.21, 50.51],
  },
  {
    en: "Benin",
    cn: "贝宁",
    cp: [2.42, 6.23],
  },
  {
    en: "Burkina Faso",
    cn: "布基纳法索",
    cp: [-1.3, 12.15],
  },
  {
    en: "Bangladesh",
    cn: "孟加拉国",
    cp: [90.26, 23.43],
  },
  {
    en: "Bulgaria",
    cn: "保加利亚",
    cp: [23.2, 42.45],
  },
  {
    en: "The Bahamas",
    cn: "巴哈马",
    cp: [-77.2, 25.05],
  },
  {
    en: "Bosnia and Herzegovina",
    cn: "波斯尼亚和黑塞哥维那",
    cp: [18.26, 43.52],
  },
  {
    en: "Belarus",
    cn: "白俄罗斯",
    cp: [27.3, 53.52],
  },
  {
    en: "Belize",
    cn: "伯利兹",
    cp: [-88.3, 17.18],
  },
  {
    en: "Bermuda",
    cn: "百慕大",
  },
  {
    en: "Bolivia",
    cn: "玻利维亚",
    cp: [-68.1, -16.2],
  },
  {
    en: "Brazil",
    cn: "巴西",
    cp: [-47.55, -15.47],
  },
  {
    en: "Brunei",
    cn: "文莱",
    cp: [115.0, 4.52],
  },
  {
    en: "Bhutan",
    cn: "不丹",
    cp: [89.45, 27.31],
  },
  {
    en: "Botswana",
    cn: "博茨瓦纳",
    cp: [25.57, -24.45],
  },
  {
    en: "Central African Republic",
    cn: "中非共和国",
    cp: [18.35, 4.23],
  },
  {
    en: "Canada",
    cn: "加拿大",
    cp: [-105.42, 56.27],
  },
  {
    en: "Switzerland",
    cn: "瑞士",
    cp: [7.28, 46.57],
  },
  {
    en: "Chile",
    cn: "智利",
    cp: [-70.4, -33.24],
  },
  {
    en: "China",
    cn: "中国",
    // cp: [113.28, 23.12]
    cp: [114.430871, 36.613201],
  },
  {
    en: "Ivory Coast",
    cn: "象牙海岸",
  },
  {
    en: "Cameroon",
    cn: "喀麦隆",
    cp: [11.35, 3.5],
  },
  {
    en: "Democratic Republic of the Congo",
    cn: "刚果民主共和国",
    cp: [15.12, -4.09],
  },
  {
    en: "Dem. Rep. Congo",
    cn: "刚果民主共和国",
    cp: [15.12, -4.09],
  },
  {
    en: "Republic of the Congo",
    cn: "刚果共和国",
    cp: [15.12, -4.09],
  },
  {
    en: "Colombia",
    cn: "哥伦比亚",
    cp: [-74.0, 4.34],
  },
  {
    en: "Costa Rica",
    cn: "哥斯达黎加",
    cp: [-84.02, 9.55],
  },
  {
    en: "Cuba",
    cn: "古巴",
    cp: [-82.22, 23.08],
  },
  {
    en: "Northern Cyprus",
    cn: "北塞浦路斯",
  },
  {
    en: "Cyprus",
    cn: "塞浦路斯",
    cp: [33.25, 35.1],
  },
  {
    en: "Czech Republic",
    cn: "捷克共和国",
    cp: [14.22, 50.05],
  },
  {
    en: "Germany",
    cn: "德国",
    cp: [13.25, 52.3],
  },
  {
    en: "Djibouti",
    cn: "吉布提",
    cp: [42.2, 11.08],
  },
  {
    en: "Denmark",
    cn: "丹麦",
    cp: [12.34, 55.41],
  },
  {
    en: "Dominican Republic",
    cn: "多明尼加共和国",
  },
  {
    en: "Algeria",
    cn: "阿尔及利亚",
    cp: [3.08, 36.42],
  },
  {
    en: "Ecuador",
    cn: "厄瓜多尔",
    cp: [-78.35, -0.15],
  },
  {
    en: "Egypt",
    cn: "埃及",
    cp: [31.14, 30.01],
  },
  {
    en: "Eritrea",
    cn: "厄立特里亚",
    cp: [38.55, 15.19],
  },
  {
    en: "Spain",
    cn: "西班牙",
    cp: [-3.45, 40.25],
  },
  {
    en: "Estonia",
    cn: "爱沙尼亚",
    cp: [24.48, 59.22],
  },
  {
    en: "Ethiopia",
    cn: "埃塞俄比亚",
    cp: [38.42, 9.02],
  },
  {
    en: "Finland",
    cn: "芬兰",
    cp: [25.03, 60.15],
  },
  {
    en: "Fiji",
    cn: "斐济",
    cp: [178.3, -18.06],
  },
  {
    en: "Falkland Islands",
    cn: "福克兰群岛",
    cp: [-59.51, -51.4],
  },
  {
    en: "France",
    cn: "法国",
    cp: [2.2, 48.5],
  },
  {
    en: "Gabon",
    cn: "加蓬",
    cp: [9.26, 0.25],
  },
  {
    en: "United Kingdom",
    cn: "英国",
    cp: [-0.05, 51.36],
  },
  {
    en: "Georgia",
    cn: "格鲁吉亚",
    cp: [44.5, 41.43],
  },
  {
    en: "Ghana",
    cn: "加纳",
    cp: [-0.06, 5.35],
  },
  {
    en: "Guinea",
    cn: "几内亚",
    cp: [-13.49, 9.29],
  },
  {
    en: "Gambia",
    cn: "冈比亚",
    cp: [-16.4, 13.28],
  },
  {
    en: "Guinea Bissau",
    cn: "几内亚比绍",
    cp: [-15.45, 11.45],
  },
  {
    en: "Equatorial Guinea",
    cn: "赤道几内亚",
    cp: [8.5, 3.45],
  },
  {
    en: "Greece",
    cn: "希腊",
    cp: [23.46, 37.58],
  },
  {
    en: "Greenland",
    cn: "格陵兰",
    cp: [-51.35, 64.1],
  },
  {
    en: "Guatemala",
    cn: "危地马拉",
    cp: [-90.22, 14.4],
  },
  {
    en: "French Guiana",
    cn: "法属圭亚那",
    cp: [-52.18, 5.05],
  },
  {
    en: "Guyana",
    cn: "圭亚那",
    cp: [-58.12, 6.5],
  },
  {
    en: "Honduras",
    cn: "洪都拉斯",
    cp: [-87.14, 14.05],
  },
  {
    en: "Croatia",
    cn: "克罗地亚",
    cp: [15.58, 45.5],
  },
  {
    en: "Haiti",
    cn: "海地",
    cp: [-72.2, 18.4],
  },
  {
    en: "Hungary",
    cn: "匈牙利",
    cp: [19.05, 47.29],
  },
  {
    en: "Indonesia",
    cn: "印度尼西亚",
    cp: [106.49, -6.09],
  },
  {
    en: "India",
    cn: "印度",
    cp: [77.13, 28.37],
  },
  {
    en: "Ireland",
    cn: "爱尔兰",
    cp: [-6.15, 53.21],
  },
  {
    en: "Iran",
    cn: "伊朗",
    cp: [51.3, 35.44],
  },
  {
    en: "Iraq",
    cn: "伊拉克",
    cp: [44.3, 33.2],
  },
  {
    en: "Iceland",
    cn: "冰岛",
    cp: [-21.57, 64.1],
  },
  {
    en: "Israel",
    cn: "以色列",
    cp: [35.12, 31.47],
  },
  {
    en: "Italy",
    cn: "意大利",
    cp: [12.29, 41.54],
  },
  {
    en: "Jamaica",
    cn: "牙买加",
    cp: [-76.5, 18.0],
  },
  {
    en: "Jordan",
    cn: "约旦",
    cp: [35.52, 31.57],
  },
  {
    en: "Japan",
    cn: "日本",
    cp: [139.731, 35.709],
  },
  {
    en: "Kazakhstan",
    cn: "哈萨克斯坦",
    cp: [71.3, 51.1],
  },
  {
    en: "Kenya",
    cn: "肯尼亚",
    cp: [36.48, -1.17],
  },
  {
    en: "Kyrgyzstan",
    cn: "吉尔吉斯斯坦",
    cp: [74.46, 42.54],
  },
  {
    en: "Cambodia",
    cn: "柬埔寨",
    cp: [104.55, 11.33],
  },
  {
    en: "Korea",
    cn: "韩国",
    cp: [126.58, 37.31],
  },
  {
    en: "Dem. Rep. Korea",
    cn: "朝鲜",
    cp: [125.3, 39.31],
  },
  {
    en: "Kosovo",
    cn: "科索沃",
  },
  {
    en: "Kuwait",
    cn: "科威特",
    cp: [48.0, 29.3],
  },
  {
    en: "Laos",
    cn: "老挝",
    cp: [102.36, 17.58],
  },
  {
    en: "Lebanon",
    cn: "黎巴嫩",
    cp: [35.31, 33.53],
  },
  {
    en: "Liberia",
    cn: "利比里亚",
    cp: [-10.47, 6.18],
  },
  {
    en: "Libya",
    cn: "利比亚",
    cp: [13.07, 32.49],
  },
  {
    en: "Sri Lanka",
    cn: "斯里兰卡",
  },
  {
    en: "Lesotho",
    cn: "莱索托",
    cp: [27.3, -29.18],
  },
  {
    en: "Lithuania",
    cn: "立陶宛",
    cp: [25.19, 54.38],
  },
  {
    en: "Luxembourg",
    cn: "卢森堡",
    cp: [6.09, 49.37],
  },
  {
    en: "Latvia",
    cn: "拉脱维亚",
    cp: [24.08, 56.53],
  },
  {
    en: "Morocco",
    cn: "摩洛哥",
  },
  {
    en: "Moldova",
    cn: "摩尔多瓦",
    cp: [28.5, 47.02],
  },
  {
    en: "Madagascar",
    cn: "马达加斯加",
    cp: [47.31, -18.55],
  },
  {
    en: "Mexico",
    cn: "墨西哥",
    cp: [-99.1, 19.2],
  },
  {
    en: "Macedonia",
    cn: "马其顿",
    cp: [21.26, 42.01],
  },
  {
    en: "Mali",
    cn: "马里",
    cp: [-7.55, 12.34],
  },
  {
    en: "Myanmar",
    cn: "缅甸",
    cp: [96.2, 16.45],
  },
  {
    en: "Montenegro",
    cn: "黑山",
  },
  {
    en: "Mongolia",
    cn: "蒙古",
  },
  {
    en: "Mozambique",
    cn: "莫桑比克",
    cp: [32.32, -25.58],
  },
  {
    en: "Mauritania",
    cn: "毛里塔尼亚",
    cp: [57.3, -20.1],
  },
  {
    en: "Malawi",
    cn: "马拉维",
    cp: [33.48, -14.0],
  },
  {
    en: "Malaysia",
    cn: "马来西亚",
    cp: [101.41, 3.09],
  },
  {
    en: "Namibia",
    cn: "纳米比亚",
    cp: [17.04, -22.35],
  },
  {
    en: "New Caledonia",
    cn: "新喀里多尼亚",
    cp: [166.3, -22.17],
  },
  {
    en: "Niger",
    cn: "尼日尔",
    cp: [2.06, 13.27],
  },
  {
    en: "Nigeria",
    cn: "尼日利亚",
    cp: [7.32, 9.05],
  },
  {
    en: "Nicaragua",
    cn: "尼加拉瓜",
    cp: [-86.2, 12.06],
  },
  {
    en: "Netherlands",
    cn: "荷兰",
    cp: [4.54, 52.23],
  },
  {
    en: "Norway",
    cn: "挪威",
    cp: [10.45, 59.55],
  },
  {
    en: "Nepal",
    cn: "尼泊尔",
    cp: [85.2, 27.45],
  },
  {
    en: "New Zealand",
    cn: "新西兰",
    cp: [174.46, -41.19],
  },
  {
    en: "Oman",
    cn: "阿曼",
    cp: [58.36, 23.37],
  },
  {
    en: "Pakistan",
    cn: "巴基斯坦",
    cp: [73.1, 33.4],
  },
  {
    en: "Panama",
    cn: "巴拿马",
    cp: [-79.25, 9.0],
  },
  {
    en: "Peru",
    cn: "秘鲁",
    cp: [-77.0, -12.0],
  },
  {
    en: "Philippines",
    cn: "菲律宾",
    cp: [121.03, 14.4],
  },
  {
    en: "Papua New Guinea",
    cn: "巴布亚新几内亚",
    cp: [147.08, -9.24],
  },
  {
    en: "Poland",
    cn: "波兰",
    cp: [21.0, 52.13],
  },
  {
    en: "Puerto Rico",
    cn: "波多黎各",
    cp: [-66.07, 18.28],
  },
  {
    en: "North Korea",
    cn: "北朝鲜",
  },
  {
    en: "Portugal",
    cn: "葡萄牙",
    cp: [-9.1, 38.42],
  },
  {
    en: "Paraguay",
    cn: "巴拉圭",
    cp: [-57.3, -25.1],
  },
  {
    en: "Qatar",
    cn: "卡塔尔",
    cp: [51.35, 25.15],
  },
  {
    en: "Romania",
    cn: "罗马尼亚",
    cp: [26.1, 44.27],
  },
  {
    en: "Russia",
    cn: "俄罗斯",
    cp: [100.35, 60.45],
  },
  {
    en: "Rwanda",
    cn: "卢旺达",
    cp: [30.04, -1.59],
  },
  {
    en: "Western Sahara",
    cn: "西撒哈拉",
  },
  {
    en: "Saudi Arabia",
    cn: "沙特阿拉伯",
    cp: [46.42, 24.41],
  },
  {
    en: "Sudan",
    cn: "苏丹",
    cp: [32.35, 15.31],
  },
  {
    en: "South Sudan",
    cn: "南苏丹",
  },
  {
    en: "Senegal",
    cn: "塞内加尔",
    cp: [-17.29, 14.34],
  },
  {
    en: "Solomon Islands",
    cn: "所罗门群岛",
    cp: [159.57, -9.27],
  },
  {
    en: "Sierra Leone",
    cn: "塞拉利昂",
    cp: [-13.17, 8.3],
  },
  {
    en: "El Salvador",
    cn: "萨尔瓦多",
    cp: [-89.1, 13.4],
  },
  {
    en: "Somaliland",
    cn: "索马里兰",
  },
  {
    en: "Somalia",
    cn: "索马里",
    cp: [45.25, 2.02],
  },
  {
    en: "Republic of Serbia",
    cn: "塞尔维亚共和国",
  },
  {
    en: "Surien",
    cn: "苏里南",
    cp: [-55.1, 5.5],
  },
  {
    en: "Slovakia",
    cn: "斯洛伐克",
    cp: [17.07, 48.1],
  },
  {
    en: "Slovenia",
    cn: "斯洛文尼亚",
    cp: [14.33, 46.04],
  },
  {
    en: "Sweden",
    cn: "瑞典",
    cp: [18.03, 59.2],
  },
  {
    en: "Swaziland",
    cn: "斯威士兰",
    cp: [31.06, -26.18],
  },
  {
    en: "Syria",
    cn: "叙利亚",
    cp: [36.18, 33.3],
  },
  {
    en: "Chad",
    cn: "乍得",
    cp: [14.59, 12.1],
  },
  {
    en: "Togo",
    cn: "多哥",
    cp: [1.2, 6.09],
  },
  {
    en: "Thailand",
    cn: "泰国",
    cp: [100.35, 13.45],
  },
  {
    en: "Tajikistan",
    cn: "塔吉克斯坦",
    cp: [68.48, 38.33],
  },
  {
    en: "Turkmenistan",
    cn: "土库曼斯坦",
    cp: [57.5, 38.0],
  },
  {
    en: "East Timor",
    cn: "东帝汶",
    cp: [125.34, -8.29],
  },
  {
    en: "Trinidad and Tobago",
    cn: "特里尼达和多巴哥",
  },
  {
    en: "Tunisia",
    cn: "突尼斯",
    cp: [10.11, 36.5],
  },
  {
    en: "Turkey",
    cn: "土耳其",
    cp: [32.54, 39.57],
  },
  {
    en: "United Republic of Tanzania",
    cn: "坦桑尼亚联合共和国",
  },
  {
    en: "Uganda",
    cn: "乌干达",
    cp: [32.3, 0.2],
  },
  {
    en: "Ukraine",
    cn: "乌克兰",
    cp: [30.28, 50.3],
  },
  {
    en: "Uruguay",
    cn: "乌拉圭",
    cp: [-56.11, -34.5],
  },
  {
    en: "United States of America",
    cn: "美国",
    cp: [-77.02, 39.91],
  },
  {
    en: "United States",
    cn: "美国",
    cp: [-97.02, 39.91],
  },
  {
    en: "Uzbekistan",
    cn: "乌兹别克斯坦",
    cp: [69.1, 41.2],
  },
  {
    en: "Venezuela",
    cn: "委内瑞拉",
    cp: [-66.55, 10.3],
  },
  {
    en: "Vietnam",
    cn: "越南",
    cp: [105.55, 21.05],
  },
  {
    en: "Vanuatu",
    cn: "瓦努阿图",
    cp: [168.18, -17.45],
  },
  {
    en: "West Bank",
    cn: "西岸",
  },
  {
    en: "Yemen",
    cn: "也门共和国",
    cp: [44.195, 15.347],
  },
  {
    en: "South Africa",
    cn: "南非",
    cp: [18.425, -33.929],
  },
  {
    en: "Zambia",
    cn: "赞比亚",
    cp: [28.16, -15.28],
  },
  {
    en: "Zimbabwe",
    cn: "津巴布韦",
    cp: [31.02, -17.43],
  },
  {
    en: "企业",
    cn: "企业",
    cp: [103.51, 36.04],
  },
  { en: "Singapore", cn: "新加坡", cp: [103.85, 1.29] },
  { en: "Indonesia", cn: "印尼", cp: [113.92, -0.79] },
  { en: "Palestine", cn: "巴勒斯坦", cp: [35.23, 31.95] },
  { en: "Bahrain", cn: "巴林", cp: [50.55, 26.02] },
  { en: "British Virgin Islands", cn: "英属维尔京群岛", cp: [64.64, 18.43] },
  { en: "Bangladesh", cn: "孟加拉", cp: [90.41, 23.68] },
  { en: "Mauritius", cn: "毛里求斯", cp: [57.55, -20.34] },
  { en: "Sao Tome and Principe", cn: "圣多美和普林西比", cp: [6.61, 0.19] },
  { en: "Czech Republic", cn: "捷克", cp: [15.47, 49.82] },
  { en: "Serbia", cn: "塞尔维亚", cp: [20.46, 44.02] },
  { en: "Seychelles", cn: "塞舌尔", cp: [55.49, -4.68] },
  { en: "Dominican Republic", cn: "多米尼加共和国", cp: [-70.16, 18.74] },
  { en: "Malta", cn: "马耳他", cp: [14.38, 35.94] },
  { en: "French Polynesia", cn: "法属波利尼西亚", cp: [-149.41, -17.68] },
  { en: "Bosnia and Herzegovina", cn: "波黑", cp: [17.68, 43.92] },
  { en: "Ivory Coast", cn: "科特迪瓦", cp: [-5.55, 7.54] },
  { en: "Mongolia", cn: "蒙古国", cp: [103.85, 46.86] },
  { en: "Tanzania", cn: "坦桑尼亚", cp: [34.89, -6.37] },
  { en: "Dominica", cn: "多米尼加", cp: [-61.37, 15.42] },
  {
    en: "Democratic Republic of the Congo",
    cn: "刚果(金)",
    cp: [21.76, -4.04],
  },
  { en: "Aruba", cn: "阿鲁巴", cp: [-69.97, 12.52] },
  { en: "North Macedonia", cn: "北马其顿", cp: [21.72, 41.61] },
];
/**
 *[getEnCountry 获取中文对应的国家英文名字]
 * @return {'name'} []
 */
export function getEnCountry(name) {
  let _name = "";
  data.forEach((item) => {
    if (name === item.cn) {
      _name = item.en;
    } else if (name === item.en) {
      _name = item.en;
    }
  });
  return _name;
}

/**
 *[getEnCountry 获取英文对应的国家中文名字]
 * @return {'name'} []
 */
export function getCnCountry(name) {
  let _name = "";
  data.forEach((item) => {
    if (name === item.en) {
      _name = item.cn;
    } else if (name === item.cn) {
      _name = item.cn;
    }
  });
  return _name;
}

/**
 *[getEnCountry 获取国家的坐标]
 * @return {'name'} []
 */
export function getCoord(name) {
  let _coord = [];
  data.forEach((item) => {
    if (name === item.en) {
      _coord = item.cp;
    } else if (name === item.cn) {
      _coord = item.cp;
    }
  });
  return _coord;
}

/**
 *[getEnCountry 世界地图映射]
 * @return {'name'} []
 */

export function mapName() {
  let obj = {};
  data.forEach((item) => {
    obj[item.en] = item.cn;
  });
  return obj;
}

const worldGeoCoordMap = {
  内蒙古自治区: [110.748672, 41.423192],
  阿富汗: [69.11, 34.28],
  阿尔巴尼亚: [19.49, 41.18],
  阿尔及利亚: [3.08, 36.42],
  美属萨摩亚: [189.57, -14.16],
  "安道​​尔": [1.32, 42.31],
  安哥拉: [13.15, -8.5],
  安提瓜和巴布达: [298.52, 17.2],
  阿根廷: [300, -36.3],
  亚美尼亚: [44.31, 40.1],
  阿鲁巴: [289.98, 12.32],
  澳大利亚: [149.08, -35.15],
  奥地利: [16.22, 48.12],
  阿塞拜疆: [49.56, 40.29],
  巴哈马: [282.8, 25.05],
  巴林: [50.3, 26.1],
  孟加拉: [90.26, 23.43],
  巴巴多斯: [300.7, 13.05],
  白俄罗斯: [27.3, 53.52],
  比利时: [4.21, 50.51],
  伯利兹: [271.7, 17.18],
  贝宁: [2.42, 6.23],
  不丹: [89.45, 27.31],
  玻利维亚: [291.9, -16.2],
  波斯尼亚和黑塞哥维那: [18.26, 43.52],
  博茨瓦纳: [25.57, -24.45],
  巴西: [312.45, -15.47],
  英属维尔京群岛: [295.63, 18.27],
  文莱: [115, 4.52],
  保加利亚: [23.2, 42.45],
  布基纳法索: [-1.3, 12.15],
  布隆迪: [29.18, -3.16],
  柬埔寨: [104.55, 11.33],
  喀麦隆: [11.35, 3.5],
  加拿大: [246.276507, 61.129539],
  佛得角: [-23.34, 15.02],
  开曼群岛: [278.76, 19.2],
  中非共和国: [18.35, 4.23],
  乍得: [14.59, 12.1],
  智利: [289.6, -33.24],
  中国: [116.2, 39.55],
  哥伦比亚: [286, 4.34],
  科摩罗: [43.16, -11.4],
  刚果: [15.12, -4.09],
  哥斯达黎加: [275.98, 9.55],
  科特迪瓦: [-5.17, 6.49],
  克罗地亚: [15.58, 45.5],
  古巴: [277.78, 23.08],
  塞浦路斯: [33.25, 35.1],
  捷克共和国: [14.22, 50.05],
  朝鲜: [125.3, 39.09],
  "刚果(扎伊尔)": [15.15, -4.2],
  丹麦: [12.34, 55.41],
  吉布提: [42.2, 11.08],
  多米尼加: [298.76, 15.2],
  多米尼加共和国: [290.41, 18.3],
  东帝汶: [125.34, -8.29],
  厄瓜多尔: [281.65, -0.15],
  埃及: [31.14, 30.01],
  萨尔瓦多: [270.9, 13.4],
  赤道几内亚: [8.5, 3.45],
  厄立特里亚: [38.55, 15.19],
  爱沙尼亚: [24.48, 59.22],
  埃塞俄比亚: [38.42, 9.02],
  "福克兰群岛(马尔维纳斯群岛)": [300.49, -51.4],
  法罗群岛: [-6.56, 62.05],
  斐济: [178.3, -18.06],
  芬兰: [25.03, 60.15],
  法国: [2.2, 48.5],
  法属圭亚那: [307.82, 5.05],
  法属波利尼西亚: [210.66, -17.32],
  加蓬: [9.26, 0.25],
  冈比亚: [-16.4, 13.28],
  格鲁吉亚: [44.5, 41.43],
  德国: [13.25, 52.3],
  加纳: [-0.06, 5.35],
  希腊: [23.46, 37.58],
  格陵兰: [308.65, 64.1],
  瓜德罗普岛: [298.56, 16],
  危地马拉: [269.78, 14.4],
  根西岛: [-2.33, 49.26],
  几内亚: [-13.49, 9.29],
  几内亚比绍: [-15.45, 11.45],
  圭亚那: [301.88, 6.5],
  海地: [287.8, 18.4],
  赫德岛和麦当劳群岛: [74, -53],
  洪都拉斯: [272.86, 14.05],
  匈牙利: [19.05, 47.29],
  冰岛: [-21.57, 64.1],
  印度: [77.13, 28.37],
  印度尼西亚: [106.49, -6.09],
  伊朗: [51.3, 35.44],
  伊拉克: [44.3, 33.2],
  爱尔兰: [-6.15, 53.21],
  以色列: [35.12, 31.47],
  意大利: [12.29, 41.54],
  牙买加: [283.5, 18],
  约旦: [35.52, 31.57],
  哈萨克斯坦: [71.3, 51.1],
  肯尼亚: [36.48, -1.17],
  基里巴斯: [173, 1.3],
  科威特: [48, 29.3],
  吉尔吉斯斯坦: [74.46, 42.54],
  老挝: [102.36, 17.58],
  拉脱维亚: [24.08, 56.53],
  黎巴嫩: [35.31, 33.53],
  莱索托: [27.3, -29.18],
  利比里亚: [-10.47, 6.18],
  阿拉伯利比亚民众国: [13.07, 32.49],
  列支敦士登: [9.31, 47.08],
  立陶宛: [25.19, 54.38],
  卢森堡: [6.09, 49.37],
  马达加斯加: [47.31, -18.55],
  马拉维: [33.48, -14],
  马来西亚: [101.41, 3.09],
  马尔代夫: [73.28, 4],
  马里: [-7.55, 12.34],
  马耳他: [14.31, 35.54],
  马提尼克岛: [298.98, 14.36],
  毛里塔尼亚: [57.3, -20.1],
  马约特岛: [45.14, -12.48],
  墨西哥: [260.9, 19.2],
  "密克罗尼西亚(联邦) ": [158.09, 6.55],
  摩尔多瓦共和国: [28.5, 47.02],
  莫桑比克: [32.32, -25.58],
  缅甸: [96.2, 16.45],
  纳米比亚: [17.04, -22.35],
  尼泊尔: [85.2, 27.45],
  荷兰: [4.54, 52.23],
  荷属安的列斯: [291, 12.05],
  新喀里多尼亚: [166.3, -22.17],
  新西兰: [174.46, -41.19],
  尼加拉瓜: [273.8, 12.06],
  尼日尔: [2.06, 13.27],
  尼日利亚: [7.32, 9.05],
  诺福克岛: [168.43, -45.2],
  北马里亚纳群岛: [145.45, 15.12],
  挪威: [10.45, 59.55],
  阿曼: [58.36, 23.37],
  巴基斯坦: [73.1, 33.4],
  帕劳: [134.28, 7.2],
  巴拿马: [280.75, 9],
  巴布亚新几内亚: [147.08, -9.24],
  巴拉圭: [302.7, -25.1],
  秘鲁: [283, -12],
  菲律宾: [121.03, 14.4],
  波兰: [21, 52.13],
  葡萄牙: [-9.1, 38.42],
  波多黎各: [293.93, 18.28],
  卡塔尔: [51.35, 25.15],
  韩国: [126.58, 37.31],
  罗马尼亚: [26.1, 44.27],
  俄罗斯: [37.35, 55.45],
  卢旺达: [30.04, -1.59],
  圣基茨和尼维斯: [297.57, 17.17],
  圣卢西亚: [299.42, 14.02],
  圣皮埃尔和密克隆: [303.88, 46.46],
  圣文森特和格林纳丁斯: [298.9, 13.1],
  萨摩亚: [188.5, -13.5],
  圣马力诺: [12.3, 43.55],
  圣多美和普林西比: [6.39, 0.1],
  沙特阿拉伯: [46.42, 24.41],
  塞内加尔: [-17.29, 14.34],
  塞拉利昂: [-13.17, 8.3],
  斯洛伐克: [17.07, 48.1],
  斯洛文尼亚: [14.33, 46.04],
  所罗门群岛: [159.57, -9.27],
  索马里: [45.25, 2.02],
  比勒陀利亚: [28.12, -25.44],
  西班牙: [-3.45, 40.25],
  苏丹: [32.35, 15.31],
  苏里南: [304.9, 5.5],
  斯威士兰: [31.06, -26.18],
  瑞典: [18.03, 59.2],
  瑞士: [7.28, 46.57],
  阿拉伯叙利亚共和国: [36.18, 33.3],
  塔吉克斯坦: [68.48, 38.33],
  泰国: [100.35, 13.45],
  马其顿: [21.26, 42.01],
  多哥: [1.2, 6.09],
  汤加: [186, -21.1],
  突尼斯: [10.11, 36.5],
  土耳其: [32.54, 39.57],
  土库曼斯坦: [57.5, 38],
  图瓦卢: [179.13, -8.31],
  乌干达: [32.3, 0.2],
  乌克兰: [30.28, 50.3],
  阿联酋: [54.22, 24.28],
  英国: [-0.05, 51.36],
  坦桑尼亚: [35.45, -6.08],
  美国: [260.994344, 37.574408],
  美属维尔京群岛: [295.44, 18.21],
  乌拉圭: [303.89, -34.5],
  乌兹别克斯坦: [69.1, 41.2],
  瓦努阿图: [168.18, -17.45],
  委内瑞拉: [293.45, 10.3],
  越南: [105.55, 21.05],
  南斯拉夫: [20.37, 44.5],
  赞比亚: [28.16, -15.28],
  津巴布韦: [31.02, -17.43],
  中国香港: [114.109497, 22.421185],
  新加坡: [103.798828, 1.428075],
  日本: [139.746094, 35.960223],
  中国台湾: [121.442871, 25.105497],
  斯里兰卡: [80.700073, 7.89603],
  中非: [20.895996, 6.184246],
  中国澳门: [113.506622, 22.159427],
  南非: [26.125488, -29.094577],
  毛里求斯: [57.528534, -20.280232],
  特立尼达和多巴哥: [298.740234, 10.682201],
  "刚果（布）": [23.752441, -1.823423],
  摩洛哥: [-7.090988, 31.791221],
  也门: [47.285156, 15.707663],
  马绍尔群岛: [171.184158, 7.133938],
  "刚果（金）": [23.752441, -1.823423],
  捷克: [14.545898, 50.099441],
  叙利亚: [37.023926, 35.038992],
  荷属圣马丁岛: [296.94942, 18.07088],
  蒙古: [107.050781, 47.960502],
  塞舌尔: [55.489197, -4.679086],
  巴勒斯坦: [35.230408, 31.963814],
  塞尔维亚共和国: [20.983887, 44.048116],
  黑山共和国: [19.297485, 42.674359],
  摩尔多瓦: [28.421631, 47.428087],
  某海关: [120.418922, 32.183969],
};

/**
 *[getEnCountry 获取国家的坐标]
 * @return {'name'} []
 */
export function getCoord2(name) {
  let _coord = [];
  data.forEach((item) => {
    if (name === item.en) {
      _coord = worldGeoCoordMap[item.cn];
    } else if (name === item.cn) {
      _coord = worldGeoCoordMap[item.cn];
    }
  });
  return _coord;
}
