export default {
  北京市: {
    zoom: 0.9,
    top: 20,
    center: [116.81995, 40.18994],
  },
  天津市: {
    zoom: 0.9,
    top: 100,
    center: [117.722503, 39.117489],
  },
  上海市: {
    zoom: 0.9,
    top: 30,
    center: [121.772644, 31.231706],
  },
  重庆市: {
    zoom: 0.95,
    top: 100,
    center: [108.504962, 29.533155],
  },
  黑龙江省: {
    zoom: 0.9,
    top: 160,
    center: [129.642464, 45.756967],
  },
  吉林省: {
    zoom: 0.9,
    top: -20,
    center: [127.3245, 43.886841],
  },
  辽宁省: {
    zoom: 0.9,
    top: -60,
    center: [123.429096, 41.796767],
  },
  内蒙古自治区: {
    zoom: 0.85,
    top: 150,
    center: [115.670801, 40.818311],
  },
  河北省: {
    zoom: 0.85,
    top: 120,
    center: [117.502461, 38.045474],
  },
  山西省: {
    zoom: 0.85,
    top: 0,
    center: [113.549248, 37.857014],
  },
  陕西省: {
    zoom: 0.85,
    top: 100,
    center: [110.939776, 34.341568],
  },
  甘肃省: {
    zoom: 0.85,
    top: 100,
    center: [103.823305, 36.058039],
  },
  青海省: {
    zoom: 0.8,
    top: -50,
    center: [97.78002, 36.62002],
  },
  山东省: {
    zoom: 0.8,
    top: -30,
    center: [119.52602, 36.66602],
  },
  河南省: {
    zoom: 0.85,
    top: -60,
    center: [114.76902, 34.75702],
  },
  湖北省: {
    zoom: 0.85,
    top: 90,
    center: [113.298572, 30.584355],
  },
  湖南省: {
    zoom: 0.85,
    top: -50,
    center: [112.982279, 28.19409],
  },
  广东省: {
    zoom: 0.9,
    top: -60,
    center: [114.394818, 23.547999],
  },
  广西壮族自治区: {
    zoom: 0.85,
    top: 100,
    center: [109.75302, 22.81602],
  },
  海南省: {
    zoom: 6,
    top: -150,
    center: [110.32902, 19.91602],
  },
  江苏省: {
    zoom: 0.85,
    top: 120,
    center: [119.76702, 32.05002],
  },
  江西省: {
    zoom: 0.85,
    top: -100,
    center: [116.85802, 28.68202],
  },
  安徽省: {
    zoom: 0.9,
    top: 30,
    center: [118.28302, 31.86102],
  },
  浙江省: {
    zoom: 0.85,
    top: -120,
    center: [121.15302, 30.26602],
  },
  福建省: {
    zoom: 0.9,
    top: 0,
    center: [119.29602, 26.10002],
  },
  西藏自治区: {
    zoom: 0.8,
    top: 120,
    center: [91.11702, 29.66002],
  },
  四川省: {
    zoom: 0.9,
    top: 0,
    center: [104.06602, 30.57202],
  },
  贵州省: {
    zoom: 0.85,
    top: 40,
    center: [107.99902, 26.64502],
  },
  云南省: {
    zoom: 0.9,
    top: 20,
    center: [103.00902, 25.04002],
  },
  宁夏回族自治区: {
    zoom: 0.85,
    top: -90,
    center: [107.35802, 38.17702],
  },
  新疆维吾尔自治区: {
    zoom: 0.85,
    top: -50,
    center: [87.61702, 43.79302],
  },
  香港特别行政区: {
    zoom: 0.8,
    top: 60,
    center: [114.2578, 22.3242],
  },
  澳门特别行政区: {
    zoom: 0.8,
    top: -120,
    center: [113.589248, 22.19302],
  },
  台湾省: {
    zoom: 0.9,
    top: -170,
    center: [121.91502, 25.05002],
  },
};
